avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
/**
 * @file main.c
 *
 * @brief MAC Example Nobeacon Application - Device
 *
 * Copyright (c) 2013-2015 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 * \section preface Preface
 * This is the reference manual for the IEEE 802.15.4 MAC No-Beacon Application
 *- Device
 * \section main_files Application Files
 *      - main.c                 Application main file.
 * \section intro Application Introduction
 * The basic MAC Example Nobeacon Application deploys a nonbeacon-enabled
 * network.
 * The coordinator starts a PAN at channel DEFAULT_CHANNEL with the PAN ID
 * DEFAULT_PAN_ID.
 * The device scans for this network and associates to the coordinator.
 * Once the device is associated, it uses a timer that fires every 5 seconds to
 * poll for pending data at the coordinator by means of transmitting a data
 * request frame to the coordinator.
 * On the other hand every 5 seconds the coordinator queues a dummy data frame
 * for each associated device into its indirect frame queue.
 * If the coordinator receives a data request frame from a particular device, it
 * transmits the pending data frame to the device.
 * Device after receiving the data from the Coordinator sends back the same data
 * to the Coordinator itself by direct data transmission
 * The results of the proper data transmission/reception are printed to a
 * terminal program via Serial I/O (UART or USB).
 * \note For Two Processor Approach the Application needs to be flashed in the
 * Host board(eg.SAM4L-Xplained Pro) and the Serial-if application(NoBeacon FFD)
 *(MAC Stack)
 * needs to be flashed in the NCP(Network CoProcessor) board.
 *
 * For demonstration purposes the coordinator's configuration is limited to
 * associate two devices at maximum.
 * \section api_modules Application Dependent Modules
 * - \subpage api
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC and IAR .
 * Other compilers may or may not work.
 *
 * \section references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal
 * Area
 *     Networks (WPANs).\n\n
 * 2)  <a href="http://www.atmel.com/design-support/">Atmel Design
 * Support</a>.\n
 *
 * \section contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.atmel.com/avr">www.atmel.com</A>.\n
 */

/* === INCLUDES ============================================================ */
#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include "common_hw_timer.h"
#include "beacon_app.h"
#include <asf.h>

/* === MACROS ============================================================== */
/** Channel Offset will give us the channel number as (CHANNEL_OFFSET + 11) */
#define CHANNEL_OFFSET                  (2)

/** Defines the short scan duration time. */
#define SCAN_DURATION_SHORT             (5)
/** Defines the long scan duration time. */
#define SCAN_DURATION_LONG              (6)

#ifndef BEACON_SUPPORT
/** This is the time period in micro seconds for polling transmissions. */
#define APP_POLL_PERIOD_MS              (5000)

#endif /* BEACON_SUPPORT */
/** Define the LED on duration time. */
#define LED_ON_DURATION                 (500000)

/*
 * This is the timeout in ms once the node tries to synchronize with the
 * coordinator. This timeout is set so that the node should be able to receive
 * at least a beacon frame from its parent.
 * In case the Beacon Order is increased to a high value, this timeout might
 * need to be increased as well.
 */
#define TIMER_SYNC_BEFORE_ASSOC_MS      (3000)
#define APP_GUARD_TIME_US               (10000)
#define MCU_WAKEUP_TIME                 (150)
#define PAYLOAD_LEN                     (104)

#ifdef GTS_SUPPORT
#define GTS_PAYLOAD_LEN                 (18)
#endif
#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#define LED_DATA                        (LED0)
#endif

/* === GLOBALS ============================================================= */
extern uint8_t default_key_source[8];
/* This structure stores the short and extended address of the coordinator. */
wpan_addr_spec_t coord_addr_spec;

/* This variable counts the number of received broadcast data frames. */
static uint32_t bc_rx_cnt;

/* This variable counts the number of received indirect data frames. */
static uint32_t indirect_rx_cnt;
/** This variable stores the current state of the node. */
app_state_t app_state = APP_IDLE;
static uint8_t APP_TIMER;
/* RTC Configuration and Callback functions */

/** This function shows the stack and application
 *  capabilities on terminal if SIO_HUB switch
 *  is enabled.
 */
static void print_stack_app_build_features(void);

#ifdef RTC_SLEEP

/**
 * @brief Configuring RTC Callback Funtion on Overflow
 *
 * @param void
 */
void configure_rtc_callbacks(void);

/**
 * @brief Configures and enables RTC count value
 *
 * @param void
 */
void configure_rtc_count(void);

/**
 * @brief Callback Function indicating RTC Overflow
 *
 * @param void
 */
void rtc_overflow_callback(void);

#endif

/** This array stores the current msdu payload. */
static uint8_t msdu_payload[PAYLOAD_LEN];

uint8_t current_channel;
uint8_t current_channel_page;
static uint32_t channels_supported;

#if (defined ENABLE_SLEEP || defined RTC_SLEEP)

/**
 * @brief API called to put the controller Power save mode with 4MHz timer
 *
 * @param timeout Time duration in microseconds for which controller can sleep
 */
static void  enter_sleep(uint32_t timeout);

/**
 * @brief Callback function to wakeup and switching to the default clock source
 * for starting MAC timers
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
void wakeup_cb(void *parameter);

