avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
/* Residual time returned to MAC for Synchronization after wakeup,When Switched
 * to Low precision clock during sleep*/
static uint32_t res;
/* This variable denotes the sleep duration returned from MAC*/
uint32_t sleep_time = 0;
/* Sleep State of the Application and MAC*/
bool sys_sleep = false;
#endif

#ifdef ENABLE_SLEEP
/* Timer for Handling Application Sleep*/
static uint8_t APP_TIMER_SLEEP;
extern void hw_overflow_cb();
extern void hw_expiry_cb();

#endif

#ifndef BEACON_SUPPORT
static uint8_t APP_TIMER_POLL_DATA;
/** This structure stores the short address of the coordinator. */
static uint16_t coord_addr;

#endif /* BEACON_SUPPORT */
#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
#undef SIO_HUB
#endif

#ifdef MAC_SECURITY_ZIP
uint8_t deviceShortAddress = 0xFF;
#endif

/* === PROTOTYPES ========================================================== */

#ifndef BEACON_SUPPORT

/**
 * @brief Callback function for the application timer
 *        initiating polling of coordinator
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void app_initiate_polling(void *parameter);

#endif

/**
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter);

/**
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter);

#ifndef BEACON_SUPPORT

/**
 * @brief function for the sending received data back to coordinator
 *
 * @param data Pointer to received data
 *
 */
static void send_data(uint8_t *data);

#endif
/** Alert to indicate something has gone wrong in the application */
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */

/**
 * @brief Main function of the device application
 */
int main(void)
{
	irq_initialize_vectors();
	#if SAMD || SAMR21
	system_init();
	delay_init();
	#else
	sysclk_init();

	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	board_init();
	#endif
#ifdef SIO_HUB
	sio2host_init();
#endif
	sw_timer_init();

	if (MAC_SUCCESS != wpan_init()) {
		app_alert();
	}

	/* Initialize LEDs. */
	LED_On(LED_START);     /* indicating application is started */
	LED_Off(LED_NWK_SETUP); /* indicating network is started */
	LED_Off(LED_DATA);     /* indicating data transmission */
	cpu_irq_enable();
#ifdef SIO_HUB

	/* Initialize the serial interface used for communication with terminal
	 * program. */

	/* To Make sure the Hyper Terminal to the System */
	sio2host_getchar();
#ifdef BEACON_SUPPORT
	printf("\nBeacon_Application\r\n\n");
#else
	printf("\nNO Beacon_Application\r\n\n");
#endif
	printf("\nDevice\r\n\n");
	print_stack_app_build_features();
#endif

	sw_timer_get_id(&APP_TIMER);
#ifndef BEACON_SUPPORT
	sw_timer_get_id(&APP_TIMER_POLL_DATA);
#endif /* BEACON_SUPPORT */

	wpan_mlme_reset_req(true);
    #ifdef ENABLE_SLEEP
	sw_timer_get_id(&APP_TIMER_SLEEP);
    #endif
	LED_Off(LED_NWK_SETUP);
	while (true) {
		wpan_task();
		#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
		/* Requesting MAC for Sleep Duration*/
		sleep_time = mac_ready_to_sleep();
		if ((sleep_time > (uint32_t)APP_GUARD_TIME_US)) {
			/*Entering Power save Mode when the sleep duration is
			 * above the guard time*/
			enter_sleep(sleep_time);
		}
		#endif
	}
}

#if defined(ENABLE_TSTAMP)

/*
 * Callback function usr_mcps_data_conf
 *
 * @param msduHandle  Handle of MSDU handed over to MAC earlier
 * @param status      Result for requested data transmission request
 * @param Timestamp   The time, in symbols, at which the data were transmitted
 *                    (only if time stamping is enabled).
 *
 */
void usr_mcps_data_conf(uint8_t msduHandle,
		uint8_t status,
		uint32_t Timestamp)
#else
void usr_mcps_data_conf(uint8_t msduHandle,
		uint8_t status)
#endif  /* ENABLE_TSTAMP */
{
}

#ifdef GTS_SUPPORT
void usr_mlme_gts_ind(uint16_t DeviceAddr, gts_char_t GtsChar)
{
	DeviceAddr = DeviceAddr;
	GtsChar = GtsChar;
}

#endif

#ifdef GTS_SUPPORT
void usr_mlme_gts_conf(gts_char_t GtsChar, uint8_t status)
{
	GtsChar = GtsChar;
	status = status;
}

#endif

/*
 * @brief Callback function usr_mcps_data_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param msduLength       Number of octets contained in MSDU
 * @param msdu             Pointer to MSDU
 * @param mpduLinkQuality  LQI measured during reception of the MPDU
 * @param DSN              DSN of the received data frame.
 * @param Timestamp        The time, in symbols, at which the data were
 * received.
 *                         (only if timestamping is enabled).
 */
#ifdef MAC_SECURITY_ZIP
void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t msduLength,
		uint8_t *msdu,
		uint8_t mpduLinkQuality,
		uint8_t DSN,
#ifdef ENABLE_TSTAMP
		uint32_t Timestamp,
				#endif  /* ENABLE_TSTAMP */
		uint8_t SecurityLevel,
		uint8_t KeyIdMode,
		uint8_t KeyIndex)
#else /* No MAC_SECURITY */

void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t msduLength,
		uint8_t *msdu,
		uint8_t mpduLinkQuality,
#ifdef ENABLE_TSTAMP
		uint8_t DSN,
		uint32_t Timestamp)
#else
		uint8_t DSN)
#endif  /* ENABLE_TSTAMP */
#endif
{
#ifdef SIO_HUB
	/* char sio_array[255]; */
#ifdef SIO_HUB
	const char Display_Received_Frame[] = "Frame received: %lu\r\n";
#endif
#endif

	if (DstAddrSpec->Addr.short_address == BROADCAST) {
		bc_rx_cnt++;
#ifdef SIO_HUB
		printf("Broadcast ");
		printf(Display_Received_Frame, bc_rx_cnt);
#endif
	} else {
		indirect_rx_cnt++;
#ifdef SIO_HUB
		printf("Frame received: ");
		for (uint8_t i = 0; i < msduLength; i++) {
			printf("%c", msdu[i]);
		}
		printf("\n\r");
#endif
	}

