avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
	/*
	 * Dummy data has been received successfully.
	 * Application code could be added here ...
	 */
	LED_On(LED_DATA);
#ifndef BEACON_SUPPORT
	send_data(msdu);
#endif  /* BEACON_SUPPORT */

	/* Start a timer switching off the LED. */
	sw_timer_start(APP_TIMER,
			LED_ON_DURATION,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)rx_data_led_off_cb,
			NULL);

	/* Keep compiler happy. */
	SrcAddrSpec = SrcAddrSpec;
	DstAddrSpec = DstAddrSpec;
	msduLength = msduLength;
	msdu = msdu;
	mpduLinkQuality = mpduLinkQuality;
	DSN = DSN;
#ifdef ENABLE_TSTAMP
	Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}

#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))

/*
 * Callback function usr_mcps_purge_conf
 *
 * @param msduHandle           Handle (id) of MSDU to be purged.
 * @param status               Result of requested purge operation.
 *
 * @return void
 *
 */
void usr_mcps_purge_conf(uint8_t msduHandle,
		uint8_t status)
{
}

#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
        **/

#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)

/*
 * @brief Callback function usr_mlme_associate_conf
 *
 * @param AssocShortAddress    Short address allocated by the coordinator
 * @param status               Result of requested association operation
 */
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
		uint8_t status)
{
	if (status == MAC_SUCCESS) {
#ifdef SIO_HUB
		printf("Connected to no beacon network\r\n");
#endif
		/* Set proper state of application. */
		app_state = APP_DEVICE_RUNNING;

		/* Stop timer used for search indication */
		sw_timer_stop(APP_TIMER);

		LED_On(LED_NWK_SETUP);
#ifndef BEACON_SUPPORT

		/* Start a timer that polls for pending data at the coordinator.
		**/
		sw_timer_start(APP_TIMER_POLL_DATA,
				((uint32_t)APP_POLL_PERIOD_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)app_initiate_polling,
				NULL);
#endif /* end of BEACON_SUPPORT */

#ifdef MAC_SECURITY_ZIP
		uint16_t mac_dev_table_entries = 3;

		wpan_mlme_set_req(macDeviceTableEntries,
				NO_PIB_INDEX,
				&mac_dev_table_entries);
#endif
	#ifdef GTS_SUPPORT
		gts_char_t gts_spec;
		gts_spec.GtsLength = 2;
		gts_spec.GtsDirection = GTS_RX_SLOT;
		gts_spec.GtsCharType = GTS_ALLOCATE;
		wpan_mlme_gts_req(AssocShortAddress, gts_spec);
	#endif
	} else {
		LED_Off(LED_NWK_SETUP);

		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	AssocShortAddress = AssocShortAddress;
#ifdef MAC_SECURITY_ZIP
	deviceShortAddress = AssocShortAddress;
#endif
}

#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */

#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)

/*
 * @brief Callback function usr_mlme_associate_ind
 *
 * @param DeviceAddress         Extended address of device requesting
 * association
 * @param CapabilityInformation Capabilities of device requesting association
 */
void usr_mlme_associate_ind(uint64_t DeviceAddress,
		uint8_t CapabilityInformation)
{
	/* Keep compiler happy. */
	DeviceAddress = DeviceAddress;
	CapabilityInformation = CapabilityInformation;
}

#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */

#if (MAC_BEACON_NOTIFY_INDICATION == 1)

/*
 * Callback function usr_mlme_beacon_notify_ind
 *
 * @param BSN            Beacon sequence number.
 * @param PANDescriptor  Pointer to PAN descriptor for received beacon.
 * @param PendAddrSpec   Pending address specification in received beacon.
 * @param AddrList       List of addresses of devices the coordinator has
 * pending data.
 * @param sduLength      Length of beacon payload.
 * @param sdu            Pointer to beacon payload.
 */
void usr_mlme_beacon_notify_ind(uint8_t BSN,
		wpan_pandescriptor_t *PANDescriptor,
		uint8_t PendAddrSpec,
		uint8_t *AddrList,
		uint8_t sduLength,
		uint8_t *sdu)
{
#ifdef BEACON_SUPPORT
	if (APP_SCAN_DONE == app_state) {
		/* Set proper state of application. */
		app_state = APP_ASSOC_IN_PROGRESS;

		/*
		 * Associate to our coordinator.
		 * Use: bool wpan_mlme_associate_req(uint8_t LogicalChannel,
		 *                                   uint8_t ChannelPage,
		 *                                   wpan_addr_spec_t
		 ******CoordAddrSpec,
		 *                                   uint8_t
		 * CapabilityInformation);
		 * This request will cause a mlme associate confirm message ->
		 * usr_mlme_associate_conf.
		 */
		wpan_mlme_associate_req(current_channel,
				current_channel_page,
				&coord_addr_spec,
				WPAN_CAP_ALLOCADDRESS);
	} else if (APP_DEVICE_RUNNING == app_state) {
#else
	if (APP_DEVICE_RUNNING == app_state) {
#endif /* BEACON_SUPPORT */

		/* This is the standard portion once the node is associated
		 * with the application.
		 */

		/*
		 * Extract the beacon payload from our coordinator and feed it
		 * back
		 * to the coordinator via a data frame.
		 */

		/* Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
		 *                              wpan_addr_spec_t *DstAddrSpec,
		 *                              uint8_t msduLength,
		 *                              uint8_t *msdu,
		 *                              uint8_t msduHandle,
		 *                              uint8_t TxOptions);
		 *
		 * This request will cause a mcps data confirm message ->
		 * usr_mcps_data_conf
		 */
		if (sduLength > PAYLOAD_LEN) {
			sduLength = PAYLOAD_LEN;
		}

		/* Copy payload from beacon frame. */
		memcpy(&msdu_payload, sdu, sduLength);

		uint8_t src_addr_mode = WPAN_ADDRMODE_SHORT;
		static uint8_t msdu_handle = 0;

		msdu_handle++;      /* Increment handle */

#ifdef MAC_SECURITY_ZIP
		wpan_mcps_data_req(src_addr_mode,
				&coord_addr_spec,
				sduLength,  /* msduLength */
				&msdu_payload[0],
				msdu_handle,
				WPAN_TXOPT_ACK,
				ZIP_SEC_MIN,     /* SecurityLevel */
				NULL,
				ZIP_KEY_ID_MODE, /* KeyIdMode */
				deviceShortAddress);  /* KeyIndex */
#else
		wpan_mcps_data_req(src_addr_mode,
				&coord_addr_spec,
				sduLength,
				&msdu_payload[0],
				msdu_handle,
				WPAN_TXOPT_ACK);
#endif

#ifdef SIO_HUB
		{
			static uint32_t rx_cnt;
			const char Rx_Beacon_Payload[]
				= "Rx beacon payload (%lu): ";

