avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
/*
 * @brief Callback function usr_mlme_reset_conf
 *
 * @param status Result of the reset procedure
 */
void usr_mlme_reset_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
#ifdef MAC_SECURITY_ZIP
		/*	wpan_mlme_get_req(phyCurrentPage,NO_PIB_INDEX);*/
		wpan_mlme_set_req(macDefaultKeySource,
				NO_PIB_INDEX,
				&default_key_source);
#else
		wpan_mlme_get_req(phyCurrentPage);
#endif
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

#if (MAC_RX_ENABLE_SUPPORT == 1)

/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	if (status == MAC_SUCCESS) {
		wpan_pandescriptor_t *coordinator;
		uint8_t i;

		/*
		 * Analyze the ResultList.
		 * Assume that the first entry of the result list is our
		 * coodinator.
		 */
		coordinator = (wpan_pandescriptor_t *)ResultList;

		for (i = 0; i < ResultListSize; i++) {
			/*
			 * Check if the PAN descriptor belongs to our
			 * coordinator.
			 * Check if coordinator allows association.
			 */
			if ((coordinator->LogicalChannel == current_channel) &&
					(coordinator->ChannelPage ==
					current_channel_page) &&
					(coordinator->CoordAddrSpec.PANId ==
					DEFAULT_PAN_ID) &&
					((coordinator->SuperframeSpec &
					((uint16_t)1 <<
					ASSOC_PERMIT_BIT_POS)) ==
					((uint16_t)1 << ASSOC_PERMIT_BIT_POS))
					) {
				/* Store the coordinator's address information.
				**/
				coord_addr_spec.AddrMode = WPAN_ADDRMODE_SHORT;
				coord_addr_spec.PANId = DEFAULT_PAN_ID;
				ADDR_COPY_DST_SRC_16(
						coord_addr_spec.Addr.short_address,
						coordinator->CoordAddrSpec.Addr.short_address);
#ifdef SIO_HUB
				printf("Found network\r\n");
#endif

#ifdef BEACON_SUPPORT
				/* Set proper state of application. */
				app_state = APP_SCAN_DONE;
#endif

				/*
				 * Set the PAN-Id of the scanned network.
				 * This is required in order to perform a proper
				 * sync
				 * before assocation.
				 * Use: bool wpan_mlme_set_req(uint8_t
				 * PIBAttribute,
				 *                             void
				 ******PIBAttributeValue);
				 *
				 * This request leads to a set confirm message
				 *-> usr_mlme_set_conf
				 */
				uint16_t pan_id;
				pan_id = DEFAULT_PAN_ID;
				wpan_mlme_set_req(macPANId,
#ifdef MAC_SECURITY_ZIP
						NO_PIB_INDEX,
#endif
						&pan_id);
#ifndef BEACON_SUPPORT
				/* Set proper state of application. */
				app_state = APP_ASSOC_IN_PROGRESS;

				/*
				 * Associate to our coordinator.
				 * Use: bool wpan_mlme_associate_req(uint8_t
				 * LogicalChannel,
				 *                                   uint8_t
				 * ChannelPage,
				 *
				 *
				 *
				 *
				 *
				 *                              wpan_addr_spec_t
				 *****CoordAddrSpec,
				 *                                   uint8_t
				 * CapabilityInformation);
				 * This request will cause a mlme associate
				 * confirm message ->
				 * usr_mlme_associate_conf.
				 */
				wpan_mlme_associate_req(
						coordinator->LogicalChannel,
						coordinator->ChannelPage,
						&(coordinator->CoordAddrSpec),
						WPAN_CAP_ALLOCADDRESS);
#endif /* BEACON_SUPPORT */
				return;
			}

			/* Get the next PAN descriptor. */
			coordinator++;
		}

		/*
		 * If here, the result list does not contain our expected
		 * coordinator.
		 * Let's scan again.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL(current_channel),
				SCAN_DURATION_SHORT,
				current_channel_page);
	} else if (status == MAC_NO_BEACON) {
		/*
		 * No beacon is received; no coordiantor is located.
		 * Scan again, but used longer scan duration.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL(current_channel),
				SCAN_DURATION_LONG,
				current_channel_page);
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	ScanType = ScanType;
	ChannelPage = ChannelPage;
	UnscannedChannels = UnscannedChannels;
}

#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
#ifndef MAC_SECURITY_ZIP

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	if ((status == MAC_SUCCESS) && (PIBAttribute == macPANId)) {
		/*
		 * Set the Coordinator Short Address of the scanned network.
		 * This is required in order to perform a proper sync
		 * before assocation.
		 */
		wpan_mlme_set_req(macCoordShortAddress, &coord_addr_spec.Addr);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macCoordShortAddress)) {
		/*
		 * Sync with beacon frames from our coordinator.
		 * Use: bool wpan_mlme_sync_req(uint8_t LogicalChannel,
		 *                              uint8_t ChannelPage,
		 *                              bool TrackBeacon);
		 *
		 * This does not lead to an immediate reaction.
		 *
		 * In case we receive beacon frames from our coordinator
		 * including
		 * a beacon payload, this is indicated in the callback function
		 * usr_mlme_beacon_notify_ind().
		 *
		 * In case the device cannot find its coordinator or later
		 * looses
		 * synchronization with its parent, this is indicated in the
		 * callback function usr_mlme_sync_loss_ind().
		 */
#ifdef BEACON_SUPPORT
		wpan_mlme_sync_req(current_channel,
				current_channel_page,
				1);
#endif /* BEACON_SUPPORT */
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

#endif

#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
}

